Finish implementing link ordering and fix a bunch of edge cases in sync flow
